# Документация Pandas

In [37]:
import pandas as pd

###  Создание DateFrame

In [38]:
df = pd.DataFrame([['Anna', 23, 3],
                  ['Sam', 36, 12],
                  ['Moica', 25, 7],
                  ['Lisa', 27, 7],
                  ['Peter', 32, None]])
df

       0   1     2
0   Anna  23   3.0
1    Sam  36  12.0
2  Moica  25   7.0
3   Lisa  27   7.0
4  Peter  32   NaN

In [39]:
df.columns = ['name', 'age', 'expr']
df

    name  age  expr
0   Anna   23   3.0
1    Sam   36  12.0
2  Moica   25   7.0
3   Lisa   27   7.0
4  Peter   32   NaN

### Обращение по индексу

In [40]:
df.iloc[1,2]

12.0

In [41]:
df.iloc[1:3,1]

1    36
2    25
Name: age, dtype: int64

In [42]:
df.iloc[1:3, :]

    name  age  expr
1    Sam   36  12.0
2  Moica   25   7.0

In [43]:
df[0:3][0:2]

   name  age  expr
0  Anna   23   3.0
1   Sam   36  12.0

### Текстовые срезы

In [44]:
df.index = df['name']
df

        name  age  expr
name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

In [45]:
df.loc['Sam', 'age']

36

In [46]:
df.loc['Sam':'Lisa', 'expr']

name
Sam      12.0
Moica     7.0
Lisa      7.0
Name: expr, dtype: float64

In [47]:
df.loc['Sam':'Lisa', ['age', 'expr']]

       age  expr
name
Sam     36  12.0
Moica   25   7.0
Lisa    27   7.0

### Определить размерность

In [48]:
df.shape

(5, 3)

In [49]:
df.shape[0]

5

In [50]:
df.shape[1]

3

### Количественные характеристики

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Anna to Lisa
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   expr    4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [53]:
df.describe()

             age       expr
count   5.000000   4.000000
mean   28.600000   7.250000
std     5.319774   3.685557
min    23.000000   3.000000
25%    25.000000   6.000000
50%    27.000000   7.000000
75%    32.000000   8.250000
max    36.000000  12.000000

### Вывод первых строк

In [51]:
df.head(2)

      name  age  expr
name
Anna  Anna   23   3.0
Sam    Sam   36  12.0

### Вывод последних строк

In [52]:
df.tail(2)

        name  age  expr
name
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

### Фильтрация значений NaN

In [54]:
df =df.dropna()
df

        name  age  expr
name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0

### Условия

In [55]:
df[df['age'] > 30]

     name  age  expr
name
Sam   Sam   36  12.0

In [56]:
df[(df['age'] > 30) & (df['expr'] > 7)]

     name  age  expr
name
Sam   Sam   36  12.0